#pragma once

// Name: Remnant Dump, Version: V1


#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

/*!!HELPER_DEF!!*/

/*!!DEFINE!!*/

namespace UFT
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// Class Remnant.AccountAward
// 0x0008 (FullSize[0x0030] - InheritedSize[0x0028])
class UAccountAward : public UObject
{
public:
	bool                                               bAllowDuplicates;                                          // 0x0028(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bNotifyOnlyOnInitialAward;                                 // 0x0029(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_ZFC6[0x6];                                     // 0x002A(0x0006) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Remnant.AccountAward");
		return ptr;
	}


};

// Class Remnant.AccountAwardRecipe
// 0x0008 (FullSize[0x00B8] - InheritedSize[0x00B0])
class UAccountAwardRecipe : public UCraftingRecipe_Base
{
public:
	class UClass*                                      Award;                                                     // 0x00B0(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Remnant.AccountAwardRecipe");
		return ptr;
	}


};

// Class Remnant.ActionBuff
// 0x0038 (FullSize[0x0260] - InheritedSize[0x0228])
class UActionBuff : public UActionBase
{
public:
	float                                              Duration;                                                  // 0x0228(0x0004) (Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               Persistent;                                                // 0x022C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_IPAA[0x3];                                     // 0x022D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FName                                       ContextualDialogTrigger;                                   // 0x0230(0x0008) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              ContextualDialogTriggerRate;                               // 0x0238(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                VisualPriority;                                            // 0x023C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              ElapsedTime;                                               // 0x0240(0x0004) (Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_ZIQ4[0xC];                                     // 0x0244(0x000C) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UVisualComponent*                            CachedVisuals;                                             // 0x0250(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UActionComponent*                            CachedActions;                                             // 0x0258(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Remnant.ActionBuff");
		return ptr;
	}


	void ResetTimer();
	void PauseDuration(bool Paused);
	bool IsDurationPaused();
	float GetRemainingTime();
	float GetElapsedTimePct();
	bool GetDesiredVisual(struct FName* Slot, struct FName* ID);
	void ApplyTimerDelta(float DeltaTime);
};

// Class Remnant.AnimNotify_ShowLastUsedItem
// 0x0008 (FullSize[0x0040] - InheritedSize[0x0038])
class UAnimNotify_ShowLastUsedItem : public UAnimNotify
{
public:
	bool                                               bShowItem;                                                 // 0x0038(0x0001) (Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_8HIL[0x7];                                     // 0x0039(0x0007) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Remnant.AnimNotify_ShowLastUsedItem");
		return ptr;
	}


};

// Class Remnant.Armor
// 0x0000 (FullSize[0x05A8] - InheritedSize[0x05A8])
class AArmor : public AEquipment
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Remnant.Armor");
		return ptr;
	}


};

// Class Remnant.Checkpoint
// 0x0000 (FullSize[0x0330] - InheritedSize[0x0330])
class ACheckpoint : public AActor
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Remnant.Checkpoint");
		return ptr;
	}


	void OnFinishActivation();
	void OnEndGrab(class ARemnantCharacter* Player);
	void OnBeginGrab(class ARemnantCharacter* Player);
	void OnBeginActivation();
	void OnActivate();
	bool CanCheckpointActivate();
};

// Class Remnant.DragonHeart
// 0x0010 (FullSize[0x0608] - InheritedSize[0x05F8])
class ADragonHeart : public AUseableItem
{
public:
	int                                                NumCharges;                                                // 0x05F8(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_KM1E[0x4];                                     // 0x05FC(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UClass*                                      UpgradeItemBP;                                             // 0x0600(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Remnant.DragonHeart");
		return ptr;
	}


	void Regenerate();
	int GetMaxCurrentQuantity();
};

// Class Remnant.EmoteAward
// 0x0028 (FullSize[0x0058] - InheritedSize[0x0030])
class UEmoteAward : public UAccountAward
{
public:
	unsigned char                                      Emote[0x28];                                               // 0x0030(0x0028) UNKNOWN PROPERTY: SoftClassProperty Remnant.EmoteAward.Emote


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Remnant.EmoteAward");
		return ptr;
	}


};

// Class Remnant.Emote
// 0x0070 (FullSize[0x0098] - InheritedSize[0x0028])
class UEmote : public UObject
{
public:
	struct FName                                       StateName;                                                 // 0x0028(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FText                                       Label;                                                     // 0x0030(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	unsigned char                                      Icon[0x28];                                                // 0x0048(0x0028) UNKNOWN PROPERTY: SoftObjectProperty Remnant.Emote.Icon
	bool                                               bOverrideAudio;                                            // 0x0070(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_M59B[0x3];                                     // 0x0071(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FName                                       SoundSetID;                                                // 0x0074(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_5LBT[0x4];                                     // 0x007C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FText                                       SubtitleText;                                              // 0x0080(0x0018) (Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Remnant.Emote");
		return ptr;
	}


	class UTexture2D* GetIcon(class UEmotesComponent* Emotes, const struct FName& Reason);
};

// Class Remnant.EmotesComponent
// 0x0040 (FullSize[0x0138] - InheritedSize[0x00F8])
class UEmotesComponent : public UActorComponent
{
public:
	struct FScriptMulticastDelegate                    OnIconLoaded;                                              // 0x00F8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<class UClass*>                              Slots;                                                     // 0x0108(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnInstance, SaveGame, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<class UClass*>                              UnlockedEmotes;                                            // 0x0118(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnInstance, SaveGame, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<struct FEmoteIconState>                     IconStates;                                                // 0x0128(0x0010) (ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Remnant.EmotesComponent");
		return ptr;
	}


	void UnlockEmote(class UClass* NewEmote);
	void SlotEmote(int Slot, class UClass* Emote);
	void ServerUpdateSlots(TArray<class UClass*> NewSlots);
	void ServerUnlockEmote(class UClass* Emote);
	class UTexture2D* RequestEmoteIcon(class UClass* Emote, const struct FName& Reason);
	void OnLoadIcon(class UClass* Emote);
	bool HasEmote(class UClass* Emote);
	TArray<class UEmote*> GetUnlockedEmotes(TArray<class UClass*> IgnoreList);
	class UEmote* GetEmoteForSlot(int Index);
	void ClearEmoteIcon(class UClass* Emote, const struct FName& Reason);
	void ClearAllEmoteIcons(const struct FName& Reason);
};

// Class Remnant.EventRegion
// 0x00D8 (FullSize[0x0408] - InheritedSize[0x0330])
class AEventRegion : public AActor
{
public:
	class UPersistenceComponent*                       PersistenceComponent;                                      // 0x0330(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       NameID;                                                    // 0x0338(0x0008) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMusicSet*                                   MusicSet;                                                  // 0x0340(0x0008) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       MusicState;                                                // 0x0348(0x0008) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               AutoStartEvent;                                            // 0x0350(0x0001) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               AutoEndEvent;                                              // 0x0351(0x0001) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               DisableCommitsWhenActive;                                  // 0x0352(0x0001) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               StartsActive;                                              // 0x0353(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               Complete;                                                  // 0x0354(0x0001) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, SaveGame, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_7GMH[0x3];                                     // 0x0355(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FScriptMulticastDelegate                    OnBegin;                                                   // 0x0358(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FScriptMulticastDelegate                    OnEnd;                                                     // 0x0368(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FScriptMulticastDelegate                    OnPlayerEnter;                                             // 0x0378(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FScriptMulticastDelegate                    OnPlayerExit;                                              // 0x0388(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FScriptMulticastDelegate                    OnPlayerDead;                                              // 0x0398(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FScriptMulticastDelegate                    OnAllPlayersDead;                                          // 0x03A8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FScriptMulticastDelegate                    OnUpdateActiveState;                                       // 0x03B8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<struct FEventRegionCharacter>               Characters;                                                // 0x03C8(0x0010) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, RepNotify, Protected, NativeAccessSpecifierProtected)
	bool                                               Active;                                                    // 0x03D8(0x0001) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                               Locked;                                                    // 0x03D9(0x0001) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_ATFL[0x6];                                     // 0x03DA(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<class APlayerController*>                   Players;                                                   // 0x03E0(0x0010) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, RepNotify, Protected, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_DJ1Y[0x8];                                     // 0x03F0(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<class URemnantQuestComponent*>              RegisteredRegionComponents;                                // 0x03F8(0x0010) (ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Remnant.EventRegion");
		return ptr;
	}


	void PlayerExit(class ARemnantCharacter* Character);
	void PlayerEnter(class ARemnantCharacter* Character);
	void OnRep_Players();
	void OnRep_Active();
	void OnDead(unsigned char Reason, class ACharacterGunfire* Character, class AActor* Cause);
	void LockEvent();
	bool IsPlayerInRegion(class APlayerController* Controller);
	bool IsLocked();
	bool IsLocalPlayerInRegion();
	bool IsComplete();
	bool IsCharacterInRegion(class ARemnantCharacter* Character);
	bool IsActive();
	bool HasLocalPlayerVisited();
	class ARemnantCharacter* GetFirstCharacter();
	static class AEventRegion* STATIC_GetEventRegionForActor(class AActor* Actor, const struct FName& EventRegionNameID);
	static class AEventRegion* STATIC_GetEventRegionContainingActor(class AActor* Actor);
	TArray<struct FEventRegionCharacter> GetCharacters();
	void End();
	void CompleteEvent();
	void Begin();
};

// Class Remnant.FlashlightInstanceData
// 0x0008 (FullSize[0x0058] - InheritedSize[0x0050])
class UFlashlightInstanceData : public UEquipmentInstanceData
{
public:
	float                                              Charge;                                                    // 0x0050(0x0004) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               Depleted;                                                  // 0x0054(0x0001) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               On;                                                        // 0x0055(0x0001) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_P4VO[0x2];                                     // 0x0056(0x0002) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Remnant.FlashlightInstanceData");
		return ptr;
	}


};

// Class Remnant.Flashlight
// 0x0040 (FullSize[0x0638] - InheritedSize[0x05F8])
class AFlashlight : public AUseableItem
{
public:
	bool                                               On;                                                        // 0x05F8(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_6TCM[0x3];                                     // 0x05F9(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              FlashThreshold;                                            // 0x05FC(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              ChargeTimeMin;                                             // 0x0600(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_0IRB[0x4];                                     // 0x0604(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<struct FName>                               LightOverlapTags;                                          // 0x0608(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<class AActor*>                              LightOverlapActors;                                        // 0x0618(0x0010) (ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_NFPU[0x10];                                    // 0x0628(0x0010) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Remnant.Flashlight");
		return ptr;
	}


	void ServerToggleFlashlight();
	void OnTurnedOn();
	void OnTurnedOff();
	void OnEndFlash();
	void OnBeginFlash();
	void LightEndOverlap(class AActor* Actor);
	void LightBeginOverlap(class AActor* Actor);
	void ApplyChargeDelta(float Delta);
};

// Class Remnant.GameReadyCondition
// 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
class UGameReadyCondition : public UCondition
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Remnant.GameReadyCondition");
		return ptr;
	}


};

// Class Remnant.GenericItem
// 0x0038 (FullSize[0x04E8] - InheritedSize[0x04B0])
class AGenericItem : public AItem
{
public:
	class USpawnTable*                                 RandomizedDrop;                                            // 0x04B0(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FName>                               SpawnTags;                                                 // 0x04B8(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                               bShareNonItemPickups;                                      // 0x04C8(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_SJBV[0x7];                                     // 0x04C9(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FSpawnList                                  CachedSpawnList;                                           // 0x04D0(0x0010) (BlueprintVisible, BlueprintReadOnly, Net, SaveGame, RepNotify, NativeAccessSpecifierPublic)
	bool                                               bUseGeneratedObjectLabel;                                  // 0x04E0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bUseGeneratedObjectIcon;                                   // 0x04E1(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bUseGeneratedObjectPickupSound;                            // 0x04E2(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bAddToInventory;                                           // 0x04E3(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bSaveOnAward;                                              // 0x04E4(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_OE9U[0x3];                                     // 0x04E5(0x0003) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Remnant.GenericItem");
		return ptr;
	}


	bool ValidatePickupHandled(const struct FSpawnList& SpawnList, class UInventoryComponent* Inventory);
	bool ValidateAddToInventory(const struct FSpawnList& SpawnList, class UInventoryComponent* Inventory);
	void OnRep_CachedSpawnList();
	void OnFinishedItemInit(const struct FSpawnList& DisplayEntry);
	bool HasMaxSpawnsForCharacter(class AActor* Actor);
	void HandleAward(const struct FSpawnList& SpawnList, class UInventoryComponent* Inventory, bool bForceNoSharing);
};

// Class Remnant.ItemType_Throwable
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UItemType_Throwable : public UItemType
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Remnant.ItemType_Throwable");
		return ptr;
	}


};

// Class Remnant.SpawnedGrenade
// 0x0060 (FullSize[0x0390] - InheritedSize[0x0330])
class ASpawnedGrenade : public AActor
{
public:
	class AGrenade*                                    Grenade;                                                   // 0x0330(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                      Mesh;                                                      // 0x0338(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSpawnedGrenadeRepData                      GrenadeRepData;                                            // 0x0340(0x0020) (Net, RepNotify, NoDestructor, Protected, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_7VZ0[0x30];                                    // 0x0360(0x0030) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Remnant.SpawnedGrenade");
		return ptr;
	}


	void OnStoppedMoving();
	void OnRep_GrenadeRepData();
	void OnDetonated();
	float GetGrenadeLifeSpan();
	class AGrenade* GetGrenadeItemCDO();
	void Detonate();
};

// Class Remnant.Grenade
// 0x00A0 (FullSize[0x0660] - InheritedSize[0x05C0])
class AGrenade : public AWeaponBase
{
public:
	EUsableActivationType                              ActivationType;                                            // 0x05C0(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bConsumeInput;                                             // 0x05C1(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_U2IB[0x2];                                     // 0x05C2(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              HoldTime;                                                  // 0x05C4(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       ThrowInput;                                                // 0x05C8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               DrawPathVisualization;                                     // 0x05D0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_C53W[0x7];                                     // 0x05D1(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UClass*                                      ProximityVisualActorBP;                                    // 0x05D8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                      Mesh;                                                      // 0x05E0(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWeaponAffinityComponent*                    WeaponAffinity;                                            // 0x05E8(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                      SpawnedGrenadeBP;                                          // 0x05F0(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       EquipAnimID;                                               // 0x05F8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       ThrowAnimID;                                               // 0x0600(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       ThrowSocket;                                               // 0x0608(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                MaxBounces;                                                // 0x0610(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              StopSpeed;                                                 // 0x0614(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              EnergyLossAlongNormal;                                     // 0x0618(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              EnergyLossAgainstNormal;                                   // 0x061C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              TraceRadius;                                               // 0x0620(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              ThrowSpeed;                                                // 0x0624(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              GravityZ;                                                  // 0x0628(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              MinimumTargetDistance;                                     // 0x062C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGrenadeState                                      State;                                                     // 0x0630(0x0001) (Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_TUYA[0x2F];                                    // 0x0631(0x002F) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Remnant.Grenade");
		return ptr;
	}


	bool ValidateUse();
	void Throw();
	void ServerThrowPressed(const struct FVector_NetQuantize& TargetLocation);
	void ServerKeyPressed(const struct FVector_NetQuantize& TargetLocation);
	void OnRep_State(EGrenadeState PreviousState);
	void MulticastThrown();
	void MulticastPlayThrowAnim();
	void MulticastPlayEquipAnim();
	float GetTotalGrenadeLifeSpan();
	float GetRemainingGrenadeLifeSpan();
	float GetRange();
	bool GetDetonatesWhenStoppedMoving();
	float GetDamageRadius();
	float GetDamage();
	static void STATIC_CalculateGrenadePath(class AActor* Projectile, class AActor* Thrower, class AGrenade* GrenadeItem, const struct FVector& StartLocation, const struct FVector& StartVelocity, float SimulationTime, TArray<struct FPredictProjectilePathPointData>* OutPath, int* OutNumBounces);
};

// Class Remnant.RemnantAnimInstance
// 0x002C (FullSize[0x0ADC] - InheritedSize[0x0AB0])
class URemnantAnimInstance : public UAnimInstanceGunfire
{
public:
	bool                                               bIsStopped;                                                // 0x0AB0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bIsJogging;                                                // 0x0AB1(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bIsSprinting;                                              // 0x0AB2(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bIsMovingRightward;                                        // 0x0AB3(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bNoLookPose;                                               // 0x0AB4(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_404C[0x3];                                     // 0x0AB5(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              JogRef;                                                    // 0x0AB8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              SprintRef;                                                 // 0x0ABC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bComputeMoveDirection;                                     // 0x0AC0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_ACNJ[0x3];                                     // 0x0AC1(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              MoveRightRef;                                              // 0x0AC4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bNeedsLookPose;                                            // 0x0AC8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_W2QF[0x3];                                     // 0x0AC9(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FName                                       NoLookPoseTag;                                             // 0x0ACC(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_9U5K[0x8];                                     // 0x0AD4(0x0008) Fix Super Size


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Remnant.RemnantAnimInstance");
		return ptr;
	}


};

// Class Remnant.GunnerAnimInstance
// 0x0024 (FullSize[0x0B00] - InheritedSize[0x0ADC])
class UGunnerAnimInstance : public URemnantAnimInstance
{
public:
	float                                              TurnSpeedAlpha;                                            // 0x0ADC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bIsAimingForward;                                          // 0x0AE0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bNeedsTargetAlign;                                         // 0x0AE1(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_TSPE[0x2];                                     // 0x0AE2(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              TurnSpeedRef;                                              // 0x0AE4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              AimForwardRef;                                             // 0x0AE8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bCheckTargetAlign;                                         // 0x0AEC(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_T0QV[0x3];                                     // 0x0AED(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FName                                       TargetAlignTag;                                            // 0x0AF0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_6OSL[0x8];                                     // 0x0AF8(0x0008) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Remnant.GunnerAnimInstance");
		return ptr;
	}


};

// Class Remnant.GunObstructionCondition
// 0x0008 (FullSize[0x0038] - InheritedSize[0x0030])
class UGunObstructionCondition : public UCondition
{
public:
	EGunObstructionTypes                               Type;                                                      // 0x0030(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               bInObstructedState;                                        // 0x0031(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_TDM7[0x6];                                     // 0x0032(0x0006) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Remnant.GunObstructionCondition");
		return ptr;
	}


};

// Class Remnant.ItemAward
// 0x0030 (FullSize[0x0060] - InheritedSize[0x0030])
class UItemAward : public UAccountAward
{
public:
	unsigned char                                      Item[0x28];                                                // 0x0030(0x0028) UNKNOWN PROPERTY: SoftClassProperty Remnant.ItemAward.Item
	int                                                Level;                                                     // 0x0058(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_UB0Y[0x4];                                     // 0x005C(0x0004) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Remnant.ItemAward");
		return ptr;
	}


};

// Class Remnant.ItemCategory_Quest
// 0x0000 (FullSize[0x0048] - InheritedSize[0x0048])
class UItemCategory_Quest : public UItemCategory
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Remnant.ItemCategory_Quest");
		return ptr;
	}


};

// Class Remnant.ItemCategory_PlayerQuest
// 0x0000 (FullSize[0x0048] - InheritedSize[0x0048])
class UItemCategory_PlayerQuest : public UItemCategory_Quest
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Remnant.ItemCategory_PlayerQuest");
		return ptr;
	}


};

// Class Remnant.LegacyTraitsComponent
// 0x0008 (FullSize[0x01C0] - InheritedSize[0x01B8])
class ULegacyTraitsComponent : public UTraitsComponent
{
public:
	ETraitProgressionType                              ProgressionType;                                           // 0x01B8(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_K7T5[0x7];                                     // 0x01B9(0x0007) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Remnant.LegacyTraitsComponent");
		return ptr;
	}


};

// Class Remnant.LootContainer
// 0x0038 (FullSize[0x0368] - InheritedSize[0x0330])
class ALootContainer : public AActor
{
public:
	struct FScriptMulticastDelegate                    OnGenerated;                                               // 0x0330(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FSpawnList                                  SpawnList;                                                 // 0x0340(0x0010) (Protected, NativeAccessSpecifierProtected)
	TArray<struct FLootContainerItem>                  Items;                                                     // 0x0350(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	bool                                               IsGenerating;                                              // 0x0360(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_HPE2[0x7];                                     // 0x0361(0x0007) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Remnant.LootContainer");
		return ptr;
	}


	void OnSpawnListLoaded();
	void Generate(class USpawnTable* SpawnTable, TArray<struct FName> SpawnTags);
	void ClearItems();
};

// Class Remnant.LoreItem
// 0x0018 (FullSize[0x04C8] - InheritedSize[0x04B0])
class ALoreItem : public AItem
{
public:
	bool                                               AutoOpenUI;                                                // 0x04B0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               OverrideHideReadUI;                                        // 0x04B1(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_LCIB[0x6];                                     // 0x04B2(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<struct FLorePage>                           Pages;                                                     // 0x04B8(0x0010) (Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Remnant.LoreItem");
		return ptr;
	}


	static void STATIC_LoreNotify(class UObject* WorldContextObject, const struct FLorePage& Page);
};

// Class Remnant.Matchmaker
// 0x06B8 (FullSize[0x06E0] - InheritedSize[0x0028])
class UMatchmaker : public UObject
{
public:
	TArray<struct FBlueprintSessionResult>             FoundSessions;                                             // 0x0028(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, NativeAccessSpecifierPublic)
	bool                                               bMatchmakingDisabled;                                      // 0x0038(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_5BCA[0x7];                                     // 0x0039(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FScriptMulticastDelegate                    OnStateFailed;                                             // 0x0040(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FScriptMulticastDelegate                    OnSessionsFound;                                           // 0x0050(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FScriptMulticastDelegate                    OnSessionCreated;                                          // 0x0060(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FScriptMulticastDelegate                    OnSessionStarted;                                          // 0x0070(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FScriptMulticastDelegate                    OnSessionEnded;                                            // 0x0080(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FScriptMulticastDelegate                    OnSessionJoined;                                           // 0x0090(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FScriptMulticastDelegate                    OnSessionJoinAttempt;                                      // 0x00A0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FScriptMulticastDelegate                    OnSessionJoinAttemptRetry;                                 // 0x00B0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FScriptMulticastDelegate                    OnSessionJoinAttemptsFailed;                               // 0x00C0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	ESessionType                                       CurrentSessionType;                                        // 0x00D0(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_FTRE[0x7];                                     // 0x00D1(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FScriptMulticastDelegate                    OnShowMatchmakingEventMessage;                             // 0x00D8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FScriptMulticastDelegate                    OnWaitDialog;                                              // 0x00E8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FScriptMulticastDelegate                    OnRegisterPlayer;                                          // 0x00F8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FScriptMulticastDelegate                    OnUnregisterPlayer;                                        // 0x0108(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_KIFW[0x5C8];                                   // 0x0118(0x05C8) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Remnant.Matchmaker");
		return ptr;
	}


	void UpdateSession();
	void UpdateJoinability(bool isJoinable);
	void StartSession();
	void ShowSessionGamertagInfo(const struct FBlueprintSessionResult& SessionInfo);
	void SetSessionJoinability(bool isJoinable);
	void RejoinLastSession();
	void OnShowQueuedMatchmakingEventMessages();
	void OnSessionEndedEvent();
	void OnPlayerNameChanged();
	void OnMainMenuLoaded();
	void KickPlayer(class APlayerController* PlayerController, bool Banned);
	void JoinSession(const struct FBlueprintSessionResult& SearchResult);
	bool IsSessionJoinable();
	bool IsPresenceJoinURLValid();
	bool IsOnline();
	bool IsLocalCharacterSurvival();
	bool IsLocalCharacterHardcore();
	bool IsJoiningSession();
	bool IsFindingSessions();
	void InviteFriend();
	void Init(class UObject* WorldContextObject, class APlayerController* PlayerController);
	struct FName GetSessionStateName();
	struct FSessionDetails GetSessionDetails(const struct FBlueprintSessionResult& Session);
	static class UMatchmaker* STATIC_GetMatchmakerInstance(class UObject* WorldContextObject);
	struct FString GetCurrentSessionDisplay();
	void EndFindSessions();
	void DestroySession();
	void CreateSession(ESessionType SessionType, bool DisableJoinability);
	void ChangeSession(ESessionType NewSessionType, bool Force);
	bool CanRejoinLastSession();
	bool CanJoinSessionGameMode(class UObject* WorldContextObject, const struct FBlueprintSessionResult& Session);
	bool CanChangeSessiontype();
	void BeginJoinPublicGame(ELastSearchType SearchType);
	void BeginFindSessions();
};

// Class Remnant.MatchmakerListenerInterface
// 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
class UMatchmakerListenerInterface : public UInterface
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Remnant.MatchmakerListenerInterface");
		return ptr;
	}


	void OnSessionStarted();
	void OnSessionsFound(TArray<struct FBlueprintSessionResult> Sessions);
	void OnSessionJoined();
	void OnSessionFailed(const struct FName& Reason);
	void OnSessionEnded();
	void OnSessionCreated();
};

// Class Remnant.MinimapThumbnail
// 0x0028 (FullSize[0x0358] - InheritedSize[0x0330])
class AMinimapThumbnail : public AActor
{
public:
	class UTexture2D*                                  Thumbnail;                                                 // 0x0330(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                TextureID;                                                 // 0x0338(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     TileSize;                                                  // 0x033C(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     TileOffset;                                                // 0x0348(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_TC0S[0x4];                                     // 0x0354(0x0004) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Remnant.MinimapThumbnail");
		return ptr;
	}


};

// Class Remnant.PlayersNearbyCondition
// 0x0008 (FullSize[0x0038] - InheritedSize[0x0030])
class UPlayersNearbyCondition : public UCondition
{
public:
	float                                              Range;                                                     // 0x0030(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               TestLOS;                                                   // 0x0034(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_PSU1[0x3];                                     // 0x0035(0x0003) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Remnant.PlayersNearbyCondition");
		return ptr;
	}


};

// Class Remnant.PlayerStateRemnant
// 0x0028 (FullSize[0x04C0] - InheritedSize[0x0498])
class APlayerStateRemnant : public APlayerStateGunfire
{
public:
	struct FScriptMulticastDelegate                    OnChatRestrictionChanged;                                  // 0x0498(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FScriptMulticastDelegate                    OnLocalPlayerTargetChanged;                                // 0x04A8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                               bTraveling;                                                // 0x04B8(0x0001) (Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                               bIsChatRestricted;                                         // 0x04B9(0x0001) (Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                               bIsLocalPlayerTarget;                                      // 0x04BA(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                               bIsHost;                                                   // 0x04BB(0x0001) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_KLRW[0x4];                                     // 0x04BC(0x0004) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Remnant.PlayerStateRemnant");
		return ptr;
	}


	void SetIsLocalPlayerTarget(bool IsTarget);
	void ServerSetChatRestricted(bool ChatRestricted);
	void OnRep_Traveling();
	void OnRep_ChatRestricted();
	bool IsTraveling();
	bool IsChatRestricted();
};

// Class Remnant.PreservedUserWidget
// 0x0000 (FullSize[0x0240] - InheritedSize[0x0240])
class UPreservedUserWidget : public UUserWidget
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Remnant.PreservedUserWidget");
		return ptr;
	}


};

// Class Remnant.QuestItemType
// 0x0028 (FullSize[0x00A8] - InheritedSize[0x0080])
class UQuestItemType : public UItemType
{
public:
	unsigned char                                      Quest[0x28];                                               // 0x0080(0x0028) UNKNOWN PROPERTY: SoftClassProperty Remnant.QuestItemType.Quest


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Remnant.QuestItemType");
		return ptr;
	}


};

// Class Remnant.QuestTrigger
// 0x0048 (FullSize[0x0378] - InheritedSize[0x0330])
class AQuestTrigger : public AActor
{
public:
	class ATriggerVolume*                              TriggerVolume;                                             // 0x0330(0x0008) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       NameID;                                                    // 0x0338(0x0008) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FScriptMulticastDelegate                    OnPlayerEnter;                                             // 0x0340(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FScriptMulticastDelegate                    OnPlayerExit;                                              // 0x0350(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
